Revit 2027 API
BuiltInFailures.SketchFailures.CurveTooShort Property
 Line is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveTooShort { get; }
Public Shared ReadOnly Property CurveTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveTooShort {
	FailureDefinitionId^ get ();
}
static member CurveTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace